# 3) შექმენით ცვლადი სადაც ერთ რიცხვს გაყოფთ მეორეზე. დაპრინტეთ თვითონ ეს ცვლადი და ასევე მისი ტიპი.
# შემდეგ კი კარგად დააკვირდით რა მოხდა, გააანალიზეთ და დაიმახსოვრეთ.


num1 = 10 / 2  # შევქმენი ცვლადი რომელსაც მნიშვნნელობად მივეცი 10 გაყოფილი 2-ზე 

print(type(num1)) # გამოვიყენე print ფუნქცია რომ გამომესახა შედეგი terminal-ზე ხოლო type ფუნქცია რომ მენახა ცვლად num1-ის ტიპი
#                      #ის აღმოჩნდა float-ი რადგან როგორც ვიცით გაყოფისას terminal-ში ყოველთვის float ტიპის მონაცემი გამოდის